package com.example.jeweller;
import java.util.ArrayList;
import java.util.List;

public class store {

    private static List<Necklace> neckaceList = new ArrayList<Necklace>();
    private static List<Stone> stonesList = new ArrayList<Stone>();


    public static List<Stone> createArrayList() {
        stonesList.add(new Stone("Рубін", "Рубі́н — За старих часів рубіни славилися як «камені життя і любові».\nВважалося, що володіння таким каменем додає \nгосподареві більше влади, сміливість і гідність.", 1, 17, 21,1,"PreciousStones"));
        stonesList.add(new Stone( "Алмаз", "Алма́з - На думку стародавніх індусів алмази утворюються з п'яти\nпершоелементів: землі, води, неба, повітря і енергії.",0, 25, 1, 1,"PreciousStones"));
        stonesList.add(new Stone("Сапфір рожевий", "Сапфі́р -Сапфір вважається каменем небес і має потужну\nкосмічну енергію. Він завжди був символом мудрості, \nсправедливості, чистоти та духовності. ",1,16, 19,   2,"PreciousStones"));
        stonesList.add(new Stone( "Евклаз", "Евклаз - Вважається, що евклаз наділяє людину мудрістю та \nпроникливістю, допомагає вчитися не лише на своїх, \nа й на чужих помилках. Камінь спрямовує потік енергії у потрібне \nрусло, сприяє концентрації на поставленій задачі.",1, 18, 1, 2,"PreciousStones"));
        stonesList.add(new Stone( "Аквамарин", "Аквамарини - вважаються магічними «барометрами» — зміна кольору каменю з ясного і чистого на каламутний і \nтемний говорить про емоційну або фізичну недугу \nйого власника.",1, 15, 1, 3,"PreciousStones"));
        stonesList.add(new Stone( "Топаз", "Топаз – камінь розсудливості, дружби, душевної чистоти та радості.\nВін вселяє в людину надію та оптимізм, здатний\n позбавити від депресії та поганих думок. ",1, 18, 15, 3,"PreciousStones"));
        stonesList.add(new Stone( "Кварц жовтий", "Кварц жовтий - З давніх часів  використовували як оберег.\nВін дарував міцний сон і рятував людей від кошмарів і дурних думок. \nСимвол сонячного світла та тепла.",1, 13, 19, 4,"PreciousStones"));
        stonesList.add(new Stone( "Аметист", "Аметист — «протидія сп'янінню». Вважається, що аметист здатний\nзцілити від головного болю (якщо його покласти на \nголову), від застуди (якщо випити воду, в \nякій перед цим добу лежав камінь), безсоння і навіть нервових зривів.",26, 17, 1, 4,"PreciousStones"));

        stonesList.add(new Stone( "Бірюза", "Бірюза - вважається щасливим та добрим каменем.\n Вона несе в собі сильну захисну силу, матері часто робили обереги\nз бірюзи для своїх дітей, щоб відігнати злих \nдухів, хвороби та погані сни.",1, 28, 11, 1,"SemipreciousStones"));
        stonesList.add(new Stone("Нефрит", "Нефрит - За китайськими повір'ями цей камінь є \nуособленням п'яти якостей людини: чесність, справедливість, милосердя,\nмужність і мудрість. Якщо його візьме людина \nз поганими помислами, камінь потемніє.",3, 9, 19,  1,"SemipreciousStones"));
        stonesList.add(new Stone( "Агат", "Aгат - приносить здоров'я, щастя та довголіття.\nАгати червоних відтінків символізують любов і відданість, раніше таким\nкамінням обмінювалися закохані, якщо їх чекала \nтривала розлука.",1, 7, 24, 2,"SemipreciousStones"));
        stonesList.add(new Stone( "Яшма", "Яшма - У давнину яшмою зцілювали зір і оберігали\nбудинки від пристріту. У храмах робили підлогу з яшми, оскільки\nцей камінь вважався божественним, що виганяє бісів. \nТакож вважалося, що для здійснення обрядів на відстані портрет \nлюдини необхідно помістити в яшмову рамку.",1, 5, 29, 2,"SemipreciousStones"));
        return stonesList;
    }

    public static List<Necklace> getNeckaceList() {return neckaceList;}
    public static List<Stone> getStonesList() {  return stonesList;}

}
